# is сравнивает является ли это одним объектом
# pass - пустая инструкция для интерпритатора
'''
1. Реализуйте алгоритм задания случайных чисел без использования
встроенного генератора псевдослучайных чисел.
'''
# from time import time
# a = time()
# # print(a)
# b = int(a % 10)
# # print(b)
# if b % 2 == 0:
#     b *= (b+b**0.5)
# else:
#     b += (b**3 + 7)
# b = round(b,0)
# print(b)

'''
2. Задайте список. Напишите программу, которая определит,
присутствует ли в заданном списке строк некое число.
'''
# a = ['324','hhgh','666']
# for s in a:
#     if s.isdigit():
#         print(s,'- число')

